## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_resource_group.app_rg will be updated in-place
  ~ resource "azurerm_resource_group" "app_rg" {
        id         = "/subscriptions/1a090018-ec06-40f5-a2ce-cce51e825f21/resourceGroups/veka0011-a12-rg"
        name       = "veka0011-a12-rg"
      ~ tags       = {
          ~ "environment" = "production" -> "test"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "veka0011-a12-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "veka0011-a12-rg"
      + virtual_network_name                           = "veka0011-a12-vnet"
    }

  # azurerm_virtual_network.app_vnet will be created
  + resource "azurerm_virtual_network" "app_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "veka0011-a12-vnet"
      + resource_group_name = "veka0011-a12-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "test"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>